In [3]:
import pandas as pd
productdf2=pd.DataFrame([[15,16,17,18],[5,6,7,8]],columns=['pen','shirt','book','mouse'])
productdf2

   pen  shirt  book  mouse
0   15     16    17     18
1    5      6     7      8

In [4]:
productdf1=pd.DataFrame([[1,2,3,4],[11,12,13,14]])
productdf1

    0   1   2   3
0   1   2   3   4
1  11  12  13  14

In [10]:
productdf3=productdf2.append(productdf1)
productdf3

      0     1     2     3  book  mouse   pen  shirt
0   NaN   NaN   NaN   NaN  17.0   18.0  15.0   16.0
1   NaN   NaN   NaN   NaN   7.0    8.0   5.0    6.0
0   1.0   2.0   3.0   4.0   NaN    NaN   NaN    NaN
1  11.0  12.0  13.0  14.0   NaN    NaN   NaN    NaN

In [11]:
productdf3["mobile"]=[13,3456,89,8]
productdf3

      0     1     2     3  book  mouse   pen  shirt  mobile
0   NaN   NaN   NaN   NaN  17.0   18.0  15.0   16.0      13
1   NaN   NaN   NaN   NaN   7.0    8.0   5.0    6.0    3456
0   1.0   2.0   3.0   4.0   NaN    NaN   NaN    NaN      89
1  11.0  12.0  13.0  14.0   NaN    NaN   NaN    NaN       8

In [13]:
productdf3.size

36

In [14]:
productdf3["bike"]=[1,2,3,4]
print(productdf3)

      0     1     2     3  book  mouse   pen  shirt  mobile  bike
0   NaN   NaN   NaN   NaN  17.0   18.0  15.0   16.0      13     1
1   NaN   NaN   NaN   NaN   7.0    8.0   5.0    6.0    3456     2
0   1.0   2.0   3.0   4.0   NaN    NaN   NaN    NaN      89     3
1  11.0  12.0  13.0  14.0   NaN    NaN   NaN    NaN       8     4

In [15]:
productdf3=productdf3.drop(columns=["pen","shirt"])
productdf3

      0     1     2     3  book  mouse  mobile  bike
0   NaN   NaN   NaN   NaN  17.0   18.0      13     1
1   NaN   NaN   NaN   NaN   7.0    8.0    3456     2
0   1.0   2.0   3.0   4.0   NaN    NaN      89     3
1  11.0  12.0  13.0  14.0   NaN    NaN       8     4

In [16]:
productdf3=productdf3.drop(index=[0])
productdf3

      0     1     2     3  book  mouse  mobile  bike
1   NaN   NaN   NaN   NaN   7.0    8.0    3456     2
1  11.0  12.0  13.0  14.0   NaN    NaN       8     4

In [17]:
p=pd.DataFrame([[1,2,3,4],[5,6,7,8]])
p

   0  1  2  3
0  1  2  3  4
1  5  6  7  8